
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/t-hirata74/aws-ecs-terraform/actions/runs/9114592789)



<pre><code>Apply complete! Resources: 3 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-07af378d4165f5bf0]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-00ca2ea0477d563ee]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0806a4307c81e6706]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-065f3a9bd9a30ce31]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0d8086f163e09cc6f]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0610a9038bfba4d73]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-06f863bb2c7da5d52]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-08f263358a70706ce]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0b4e9caa131606ee9]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0e8b587a66fe3fa57]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-00dccb3606061ec2f]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-00195e3d69f68e993]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0cfd5d89ce87428b5]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-086b9d2de456ab0ac]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0a7e2848d24017fdc]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0efa12a3edc7d6c5c]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-00ca2ea0477d563ee1080289494]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0d2b3ccd985ce0109]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-096bf982d7c173294]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0fd494e1ca2cb7aa2]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-07a81b708a4076106]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0b4e9caa131606ee91080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-08f263358a70706ce1080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "For ALB."
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all to outbound."
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTP from ALL."
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "go-simple-server-alb"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "go-simple-server-alb"
        }
      + tags_all               = {
          + "Name" = "go-simple-server-alb"
        }
      + vpc_id                 = "vpc-07af378d4165f5bf0"
    }

  # aws_security_group.ecs will be created
  + resource "aws_security_group" "ecs" {
      + arn                    = (known after apply)
      + description            = "For ECS."
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all to outbound."
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "go-simple-server-ecs"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "go-simple-server-ecs"
        }
      + tags_all               = {
          + "Name" = "go-simple-server-ecs"
        }
      + vpc_id                 = "vpc-07af378d4165f5bf0"
    }

  # aws_security_group_rule.ecs_from_alb will be created
  + resource "aws_security_group_rule" "ecs_from_alb" {
      + description              = "Allow 8080 from Security Group for ALB."
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
aws_security_group.ecs: Creating...
aws_security_group.alb: Creating...
aws_security_group.ecs: Creation complete after 5s [id=sg-0c9996bfe724a8f58]
aws_security_group.alb: Creation complete after 5s [id=sg-01de57f1916a31952]
aws_security_group_rule.ecs_from_alb: Creating...
aws_security_group_rule.ecs_from_alb: Creation complete after 1s [id=sgrule-1140129633]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":3,"Program":"tfcmt","SHA1":"bf8bf0c2e1a564bca84dc5a54f519c7ff62c898e","Vars":{},"WorkflowName":"Terraform"} -->